intro-fp3.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Functional Programming Patterns</title>
<meta name="author" content="(Артем)"/>
<link rel="stylesheet" href="./reveal.js-3.8.0/css/reveal.css"/>

<link rel="stylesheet" href="./reveal.js-3.8.0/css/theme/moon.css" id="theme"/>

<link rel="stylesheet" href="./css/local.css"/>

<link rel="stylesheet" href="./css/ember.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Functional Programming Patterns</h1>
</section>


<section>
<section id="slide-org0289e49">
<h2 id="org0289e49">Learn Haskell in 10 minutes</h2>
<aside class="notes">
<p>
Haskell чистый функциональный язык программирования общего назначения c ленивой моделью вычисления.
Ленивый - означает, что любые значения вычисляются только когда они нужны
Чистый - означает, что все функции в хаскеле чистые, то есть не производят никаких сторонних эфектов
</p>

<p>
Это кажется немного странным, как же без сторонних эффектов и изменения
состояния написать хоть сколько нибудь осмысленную программу?
</p>

<p>
Если проводить параллели с языком Java, то можно воспользоваться следующей интуицией:
Представим, что у нас все переменные стали final, а структуры иммутабельными.
Все операции связанные с вводом/выводом возвращают значения, обернутые в Future
(причем такие Future, которые не запускаются при создании).
То есть, например, мы обращаемся к БД и получаем не ResultSet, а
`Future&lt;ResultSet&gt;`. И так с любой IO операцией.
В дополнение к этому, мы не можем получить значение из этой Future, то есть у
этой Future нет метода `.get()`
Только сама jvm в `main` методе может получить значение из этой Future.
И единственное что нам остается, пытаться композировать все эти Future в одну
Future и возвращать ее в `main` методе, который уже ее запустит.
</p>

<p>
При таких ограничениях получается что наша программа - это одно большое
выражение, которое возвращает Future. А эта Future является композицией других Future.
Таким образом мы достигаем чистоты функций так, как никаких сайд эфектов при
вызове функций не происходит.
</p>

<p>
Ленивость языка проявляется в том, что все вычисления производятся только тогда,
когда их результат потребуется.
</p>

</aside>
</section>
<section id="slide-orge240be5">
<h3 id="orge240be5">Lists</h3>
<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #98be65;">"Hello"</span> <span style="color: #dcaeea;">++</span> <span style="color: #98be65;">", World!"</span> <span style="color: #5B6268;">-- </span><span style="color: #5B6268;">"Hello world!"</span></code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code>[<span style="color: #da8548; font-weight: bold;">1</span><span style="color: #dcaeea;">..</span><span style="color: #da8548; font-weight: bold;">5</span>] <span style="color: #dcaeea;">==</span> [<span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #da8548; font-weight: bold;">2</span>, <span style="color: #da8548; font-weight: bold;">3</span>, <span style="color: #da8548; font-weight: bold;">4</span>, <span style="color: #da8548; font-weight: bold;">5</span>]</code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code>[<span style="color: #98be65;">'A'</span><span style="color: #dcaeea;">..</span><span style="color: #98be65;">'F'</span>] <span style="color: #dcaeea;">==</span> <span style="color: #98be65;">"ABCDEF"</span></code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code>[<span style="color: #da8548; font-weight: bold;">1</span><span style="color: #dcaeea;">..</span>]</code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code>[<span style="color: #da8548; font-weight: bold;">1</span><span style="color: #dcaeea;">..</span><span style="color: #da8548; font-weight: bold;">3</span>] <span style="color: #dcaeea;">++</span> [<span style="color: #da8548; font-weight: bold;">4</span><span style="color: #dcaeea;">..</span><span style="color: #da8548; font-weight: bold;">6</span>] <span style="color: #5B6268;">-- </span><span style="color: #5B6268;">[1, 2, 3, 4, 5, 6]</span></code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #ECBE7B;">:</span> [<span style="color: #da8548; font-weight: bold;">2</span>, <span style="color: #da8548; font-weight: bold;">3</span>, <span style="color: #da8548; font-weight: bold;">4</span>] <span style="color: #5B6268;">-- </span><span style="color: #5B6268;">[1, 2, 3, 4]</span></code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code>[x<span style="color: #dcaeea;">*</span><span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #dcaeea;">|</span> x <span style="color: #dcaeea;">&lt;-</span> [<span style="color: #da8548; font-weight: bold;">1</span><span style="color: #dcaeea;">..</span><span style="color: #da8548; font-weight: bold;">5</span>]] <span style="color: #5B6268;">-- </span><span style="color: #5B6268;">[2, 4, 6, 8, 10]</span></code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code>[(x, y) <span style="color: #dcaeea;">|</span> x <span style="color: #dcaeea;">&lt;-</span> [<span style="color: #da8548; font-weight: bold;">1</span><span style="color: #dcaeea;">..</span><span style="color: #da8548; font-weight: bold;">3</span>], y <span style="color: #dcaeea;">&lt;-</span> [<span style="color: #da8548; font-weight: bold;">1</span><span style="color: #dcaeea;">..</span><span style="color: #da8548; font-weight: bold;">3</span>], x <span style="color: #dcaeea;">+</span> y <span style="color: #dcaeea;">&gt;</span> <span style="color: #da8548; font-weight: bold;">4</span>] <span style="color: #5B6268;">-- </span><span style="color: #5B6268;">[(2,3), (3,2), (3,3)]</span></code>
</code></pre>
</div>

</section>
<section id="slide-org193d8fb">
<h3 id="org193d8fb">Functions</h3>
<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #c678dd;">add</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Integer</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Integer</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Integer</span></code>
<code><span style="color: #c678dd;">add</span> a b <span style="color: #dcaeea;">=</span> a <span style="color: #dcaeea;">+</span> b</code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #c678dd;">add</span> <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #da8548; font-weight: bold;">3</span> <span style="color: #5B6268;">-- </span><span style="color: #5B6268;">4</span></code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #c678dd;">addOne</span> <span style="color: #dcaeea;">=</span> add <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #5B6268;">-- </span><span style="color: #5B6268;">:: Integer -&gt; Integer</span></code>
<code></code>
<code><span style="color: #c678dd;">addOne</span> <span style="color: #da8548; font-weight: bold;">4</span> <span style="color: #5B6268;">-- </span><span style="color: #5B6268;">5</span></code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #c678dd;">main</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">IO</span> <span style="color: #ECBE7B;">()</span></code>
<code><span style="color: #c678dd;">main</span> <span style="color: #dcaeea;">=</span> putStrLn <span style="color: #98be65;">"Hello, World!"</span></code>
</code></pre>
</div>

</section>
<section id="slide-org31ded97">
<h3 id="org31ded97">Controls</h3>
<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #c678dd;">factorial</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Integer</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Integer</span></code>
<code><span style="color: #c678dd;">factorial</span> n <span style="color: #dcaeea;">=</span> <span style="color: #51afef;">if</span> n <span style="color: #dcaeea;">&lt;</span> <span style="color: #da8548; font-weight: bold;">2</span></code>
<code>              <span style="color: #51afef;">then</span> <span style="color: #da8548; font-weight: bold;">1</span></code>
<code>              <span style="color: #51afef;">else</span> n <span style="color: #dcaeea;">*</span> factorial (n <span style="color: #dcaeea;">-</span> <span style="color: #da8548; font-weight: bold;">1</span>)</code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #c678dd;">factorial</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Integer</span> <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Integer</span></code>
<code><span style="color: #c678dd;">factorial</span> <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #dcaeea;">=</span> <span style="color: #da8548; font-weight: bold;">1</span></code>
<code><span style="color: #c678dd;">factorial</span> n <span style="color: #dcaeea;">=</span> n <span style="color: #dcaeea;">*</span> factorial (n <span style="color: #dcaeea;">-</span> <span style="color: #da8548; font-weight: bold;">1</span>)</code>
</code></pre>
</div>

</section>
<section id="slide-orgf8a916a">
<h3 id="orgf8a916a"><span class="todo TODO">TODO</span> Data</h3>

</section>
</section>
<section>
<section id="slide-org8254655">
<h2 id="org8254655">Patterns</h2>
<aside class="notes">
<p>
Функциональное программирование часто критикуют за использование математического
жаргона. Термины вроде зигохистоморфный препроморфизм конечно не помогают
продавать ФП. Названия же паттернов ООП более привычны для нас &ldquo;Мост&rdquo;, &ldquo;Фасад&rdquo;,
&ldquo;Адаптер&rdquo;, но в тоже время эти знакомые названия не очень то помогают в
понимании реализации паттернов.
</p>

<p>
В ФП паттерны имеют под собой математическую основу со своими законами, в ООП же
любой паттерн можно реализовать множеством разных способов и это не будет ошибкой.
</p>

</aside>

<div class="LEFTCOL">
<ul>
<li>Semigroup</li>
<li>Monoid</li>
<li>Functor</li>
<li>Monad</li>
<li>Catamorphism</li>

</ul>

</div>

<div class="RIGHTCOL">
<ul>
<li class="fragment roll-in">Appendable</li>
<li class="fragment roll-in">Aggregatable</li>
<li class="fragment roll-in">Mappable</li>
<li class="fragment roll-in">Chainable</li>
<li class="fragment roll-in">Collapsable</li>

</ul>

</div>

</section>
</section>
