intro-fp3.org
* Semigroup
#+REVEAL: split
#+BEGIN_NOTES
Паттерн проектирования можно определить как часто встречающееся решение
определенной проблемы при проектировании архитектуры программ. Давайте
рассмотрим код, в котором мы запускаем приложение с конфигурациями полученными из
разных источников, и попробуем выделить в нем паттерн.

Для начала определим первый источник конфигурации - аргументы запуска приложения:
#+END_NOTES
#+BEGIN_SRC java
    Config configFromArgs = fromArgs(args);
    startApplication(configFromArgs);


#+END_SRC
#+BEGIN_NOTES
Теперь добавим возможность конфигурирования приложения через файл. Что теперь мы
передадим в функцию startApplicaton?
#+END_NOTES
#+REVEAL: split
#+BEGIN_SRC java
    Config configFromArgs = fromArgs(args);
    Config configFromFile = fromFile("config.yml");
    startApplication(???);

#+END_SRC
#+BEGIN_NOTES
Если мы не хотим менять сигнатуру функции startApplication, то решением может
стать некая функция combine, которая соединяет два конфига из разных источников
в один объект.
#+END_NOTES
#+REVEAL: split
#+BEGIN_SRC java
    Config configFromArgs = fromArgs(args);
    Config configFromFile = fromFile("config.yml");
    Config config = combine(configFromFile, configFromArgs);
    startApplication(config);
#+END_SRC
#+BEGIN_NOTES
Если источников конфигурации станет больше двух, то мы с легкостью можем написать
функцию, которая применяя функцию combine сворачивает список конфигов из разных
источников:
#+END_NOTES
#+REVEAL: split
#+BEGIN_SRC java
Config config = combineAll(configFromServer,
                         configFromFile,
                         configFromSystemEnv,
                         configFromArgs);
#+END_SRC
#+BEGIN_NOTES
Нам даже не важно в каком порядке будут объединяться конфиги, пока сохраняется
общая последовательность их объединения. Мы можем сначала объединить
configFromSystemEnv и configFromArgs, потом configFromServer и configFromFile, и
затем объединить результаты предыдущих объединений. В математике такое свойство
операции называется ассоциативностью.

Конфиг в примере выше можно заменить на получение и композицию метрик с разных
серверов или соединение логов с нескольких сервисов. Объединяет их одно -
функция композиции, со следующей сигнатурой:
#+END_NOTES

#+REVEAL: split
#+BEGIN_SRC java
public <T> T apply(T a, T b);
#+END_SRC

#+BEGIN_NOTES
Функция принимает два аргумента одного типа и возвращает результат того же типа
что и аргументы. В общей алгебре множество с заданной на нем ассоциативной бинарной
операцией называется полугруппой. Математики это определение записывают
следующим образом:
#+END_NOTES
** Overview
#+REVEAL: split
$$
(G, \cdot  : G \times  G \rightarrow  G)\\
(x \cdot y) \cdot z = x \cdot (y \cdot z)
$$

#+REVEAL: split
#+BEGIN_NOTES
Теперь давайте попробуем представить полугруппу в виде Java интерфейса:
#+END_NOTES
#+BEGIN_SRC java
public interface Semigroup<A> {
    A apply(A a, A b);
}
#+END_SRC

#+BEGIN_NOTES
И тоже самое в Haskell:
#+END_NOTES
#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC haskell
class Semigroup a where
  (<>) :: a -> a -> a
#+END_SRC

