intro-fp3.html
<section>
<section id="slide-orga7582e0">
<h2 id="orga7582e0">Semigroup</h2>
</section>
<section id="slide-orga7582e0-split">
<aside class="notes">
<p>
Паттерн проектирования можно определить как часто встречающееся решение
определенной проблемы при проектировании архитектуры программ. Давайте
рассмотрим код, в котором мы запускаем приложение с конфигурациями полученными из
разных источников, и попробуем выделить в нем паттерн.
</p>

<p>
Для начала определим первый источник конфигурации - аргументы запуска приложения:
</p>

</aside>
<div class="org-src-container">

<pre  class="src src-java"><code trim><code>    <span style="color: #ECBE7B;">Config</span> <span style="color: #dcaeea;">configFromArgs</span> = fromArgs<span style="color: #51afef;">(</span>args<span style="color: #51afef;">)</span>;</code>
<code>    startApplication<span style="color: #51afef;">(</span>configFromArgs<span style="color: #51afef;">)</span>;</code>
<code></code>
<code></code>
</code></pre>
</div>
<aside class="notes">
<p>
Теперь добавим возможность конфигурирования приложения через файл. Что теперь мы
передадим в функцию startApplicaton?
</p>

</aside>
</section>
<section id="slide-orga7582e0-split">
<div class="org-src-container">

<pre  class="src src-java"><code trim><code>    <span style="color: #ECBE7B;">Config</span> <span style="color: #dcaeea;">configFromArgs</span> = fromArgs<span style="color: #51afef;">(</span>args<span style="color: #51afef;">)</span>;</code>
<code>    <span style="color: #ECBE7B;">Config</span> <span style="color: #dcaeea;">configFromFile</span> = fromFile<span style="color: #51afef;">(</span><span style="color: #98be65;">"config.yml"</span><span style="color: #51afef;">)</span>;</code>
<code>    startApplication<span style="color: #51afef;">(</span>???<span style="color: #51afef;">)</span>;</code>
<code></code>
</code></pre>
</div>
<aside class="notes">
<p>
Если мы не хотим менять сигнатуру функции startApplication, то решением может
стать некая функция combine, которая соединяет два конфига из разных источников
в один объект.
</p>

</aside>
</section>
<section id="slide-orga7582e0-split">
<div class="org-src-container">

<pre  class="src src-java"><code trim><code>    <span style="color: #ECBE7B;">Config</span> <span style="color: #dcaeea;">configFromArgs</span> = fromArgs<span style="color: #51afef;">(</span>args<span style="color: #51afef;">)</span>;</code>
<code>    <span style="color: #ECBE7B;">Config</span> <span style="color: #dcaeea;">configFromFile</span> = fromFile<span style="color: #51afef;">(</span><span style="color: #98be65;">"config.yml"</span><span style="color: #51afef;">)</span>;</code>
<code>    <span style="color: #ECBE7B;">Config</span> <span style="color: #dcaeea;">config</span> = combine<span style="color: #51afef;">(</span>configFromFile, configFromArgs<span style="color: #51afef;">)</span>;</code>
<code>    startApplication<span style="color: #51afef;">(</span>config<span style="color: #51afef;">)</span>;</code>
</code></pre>
</div>
<aside class="notes">
<p>
Если источников конфигурации станет больше двух, то мы с легкостью можем написать
функцию, которая применяя функцию combine сворачивает список конфигов из разных
источников:
</p>

</aside>
</section>
<section id="slide-orga7582e0-split">
<div class="org-src-container">

<pre  class="src src-java"><code trim><code><span style="color: #ECBE7B;">Config</span> <span style="color: #dcaeea;">config</span> = combineAll<span style="color: #51afef;">(</span>configFromServer,</code>
<code>                         configFromFile,</code>
<code>                         configFromSystemEnv,</code>
<code>                         configFromArgs<span style="color: #51afef;">)</span>;</code>
</code></pre>
</div>
<aside class="notes">
<p>
Нам даже не важно в каком порядке будут объединяться конфиги, пока сохраняется
общая последовательность их объединения. Мы можем сначала объединить
configFromSystemEnv и configFromArgs, потом configFromServer и configFromFile, и
затем объединить результаты предыдущих объединений. В математике такое свойство
операции называется ассоциативностью.
</p>

<p>
Конфиг в примере выше можно заменить на получение и композицию метрик с разных
серверов или соединение логов с нескольких сервисов. Объединяет их одно -
функция композиции, со следующей сигнатурой:
</p>

</aside>

</section>
<section id="slide-orga7582e0-split">
<div class="org-src-container">

<pre  class="src src-java"><code trim><code><span style="color: #51afef;">public</span> <span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #ECBE7B;">T</span> <span style="color: #c678dd;">apply</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">T</span> <span style="color: #dcaeea;">a</span>, <span style="color: #ECBE7B;">T</span> <span style="color: #dcaeea;">b</span><span style="color: #51afef;">)</span>;</code>
</code></pre>
</div>

<aside class="notes">
<p>
Функция принимает два аргумента одного типа и возвращает результат того же типа
что и аргументы. В общей алгебре множество с заданной на нем ассоциативной бинарной
операцией называется полугруппой. Математики это определение записывают
следующим образом:
</p>

</aside>
</section>
<section id="slide-orgf7d9faa">
<h3 id="orgf7d9faa">Overview</h3>
</section>
<section id="slide-orgf7d9faa-split">
<p>
\[
(G, \cdot  : G \times  G \rightarrow  G)\\
(x \cdot y) \cdot z = x \cdot (y \cdot z)
\]
</p>

</section>
<section id="slide-orgf7d9faa-split">
<aside class="notes">
<p>
Теперь давайте попробуем представить полугруппу в виде Java интерфейса:
</p>

</aside>
<div class="org-src-container">

<pre  class="src src-java"><code trim><code><span style="color: #51afef;">public</span> <span style="color: #51afef;">interface</span> <span style="color: #ECBE7B;">Semigroup</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">A</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span></code>
<code>    <span style="color: #ECBE7B;">A</span> <span style="color: #c678dd;">apply</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">A</span> <span style="color: #dcaeea;">a</span>, <span style="color: #ECBE7B;">A</span> <span style="color: #dcaeea;">b</span><span style="color: #c678dd;">)</span>;</code>
<code><span style="color: #51afef;">}</span></code>
</code></pre>
</div>

<aside class="notes">
<p>
И тоже самое в Haskell:
</p>

</aside>
<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Semigroup</span> a <span style="color: #51afef;">where</span></code>
<code>  (<span style="color: #dcaeea;">&lt;&gt;</span>) <span style="color: #dcaeea;">::</span> a <span style="color: #dcaeea;">-&gt;</span> a <span style="color: #dcaeea;">-&gt;</span> a</code>
</code></pre>
</div>

</section>
