intro-fp3.org
** Examples
#+REVEAL: split
#+BEGIN_NOTES
Приведем несколько примеров полугрупп.
Первый пример: строки и операция конкатенации.
#+END_NOTES
#+BEGIN_SRC java
static class StringSemigroup implements Semigroup<String> {
    public String apply(String x, String y) {
        return x + y;
    }
}
#+END_SRC

#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC java
StringSemigroup ss = new StringSemigroup();
ss.apply("Hello", ss.apply(" ", "World"));
#+END_SRC

#+REVEAL: split
#+BEGIN_NOTES
Тоже самое на Haskell
#+END_NOTES
#+BEGIN_SRC haskell
instance Semigroup String where
  (<>) = (++)
#+END_SRC

#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC haskell
"Hello" <> " " <> "World"
#+END_SRC

#+RESULTS:
: Prelude> "Hello World"

#+REVEAL: split
#+BEGIN_NOTES
Другой пример полугруппы - множество целых чисел и определенная на них операция
минимума:
#+END_NOTES
#+BEGIN_SRC java
class MinIntSemigroup implements Semigroup<Integer> {
    public Integer apply(Integer a, Integer b) {
        return a < b ? a : b;
    }
}
#+END_SRC

#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC java
MinIntSemigroup ms = new MinIntSemigroup();
ms.apply(100, ms.apply(42, 512));
#+END_SRC

#+REVEAL: split
#+BEGIN_NOTES
Довольно легко написать функцию свертки на списке полугрупп. Со
следующей сигнатурой:
#+END_NOTES
#+BEGIN_SRC java
Optional<T> sconcat(Semigroup<T> semigroup, List<T> list)
#+END_SRC

#+BEGIN_SRC haskell
sconcat :: Semigroup a => [a] -> Maybe a
#+END_SRC

#+BEGIN_NOTES
Сразу бросается в глаза то, что функция sconcat вынуждена возвращать тип
Optional, так как мы можем передать в нее пустой список. С полугруппой
MinIntSemigroup это оправдано, так как не понятно, что нам возвращать в случае
пустого списка. Но, например, для полугруппы StringSemigroup мы бы могли вернуть
пустую строку, а в случае с конфигами - пустой конфиг без параметров. Для этого
нам нужно добавить к бинарной операции еще некий нейтральный элемент и таким
образом мы получаем моноид.
#+END_NOTES

* Monoid
** Overview
#+BEGIN_NOTES
Моноидом называется множество M, на котором задана бинарная ассоциативная
операция, и в котором существует нейтральный элемент e, удовлетворяющий
следующему равенству:
#+END_NOTES

$$
(G, \cdot  : G \times  G \rightarrow  G)\\
(x \cdot y) \cdot z = x \cdot (y \cdot z)\\
e \cdot x = x \cdot e = x
$$

#+REVEAL: split
#+BEGIN_NOTES
Выразим это в виде Java интерфейса, расширив интерфейс полугруппы, так как по
определению любой моноид также является и полугруппой:
#+END_NOTES
#+BEGIN_SRC java
public interface Monoid<A> extends Semigroup<A> {
    A empty();
}
#+END_SRC

#+BEGIN_NOTES
И в виде класса типов в Haskell:
#+END_NOTES
#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC haskell
class Semigroup a => Monoid a where
  mempty  :: a
#+END_SRC

