intro-fp3.html
<section id="slide-org0e193a5">
<h3 id="org0e193a5">Examples</h3>
</section>
<section id="slide-org0e193a5-split">
<aside class="notes">
<p>
Приведем несколько примеров полугрупп.
Первый пример: строки и операция конкатенации.
</p>

</aside>
<div class="org-src-container">

<pre  class="src src-java"><code trim><code><span style="color: #51afef;">static</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">StringSemigroup</span> <span style="color: #51afef;">implements</span> <span style="color: #ECBE7B;">Semigroup</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">String</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span></code>
<code>    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">String</span> <span style="color: #c678dd;">apply</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">x</span>, <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">y</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span></code>
<code>        <span style="color: #51afef;">return</span> x + y;</code>
<code>    <span style="color: #c678dd;">}</span></code>
<code><span style="color: #51afef;">}</span></code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #ECBE7B;">StringSemigroup</span> <span style="color: #dcaeea;">ss</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">StringSemigroup</span><span style="color: #51afef;">()</span>;</code>
<code>ss.apply<span style="color: #51afef;">(</span><span style="color: #98be65;">"Hello"</span>, ss.apply<span style="color: #c678dd;">(</span><span style="color: #98be65;">" "</span>, <span style="color: #98be65;">"World"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>;</code>
</code></pre>
</div>

</section>
<section id="slide-org0e193a5-split">
<aside class="notes">
<p>
Тоже самое на Haskell
</p>

</aside>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><code><span style="color: #51afef;">instance</span> <span style="color: #ECBE7B;">Semigroup</span> <span style="color: #ECBE7B;">String</span> <span style="color: #51afef;">where</span></code>
<code>  (<span style="color: #dcaeea;">&lt;&gt;</span>) <span style="color: #dcaeea;">=</span> (<span style="color: #dcaeea;">++</span>)</code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #98be65;">"Hello"</span> <span style="color: #dcaeea;">&lt;&gt;</span> <span style="color: #98be65;">" "</span> <span style="color: #dcaeea;">&lt;&gt;</span> <span style="color: #98be65;">"World"</span></code>
</code></pre>
</div>

</section>
<section id="slide-org0e193a5-split">
<aside class="notes">
<p>
Другой пример полугруппы - множество целых чисел и определенная на них операция
минимума:
</p>

</aside>
<div class="org-src-container">

<pre  class="src src-java"><code trim><code><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">MinIntSemigroup</span> <span style="color: #51afef;">implements</span> <span style="color: #ECBE7B;">Semigroup</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">Integer</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span></code>
<code>    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">Integer</span> <span style="color: #c678dd;">apply</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">Integer</span> <span style="color: #dcaeea;">a</span>, <span style="color: #ECBE7B;">Integer</span> <span style="color: #dcaeea;">b</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span></code>
<code>        <span style="color: #51afef;">return</span> a &lt; <span style="color: #ECBE7B;">b</span> ? a : b;</code>
<code>    <span style="color: #c678dd;">}</span></code>
<code><span style="color: #51afef;">}</span></code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #ECBE7B;">MinIntSemigroup</span> <span style="color: #dcaeea;">ms</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">MinIntSemigroup</span><span style="color: #51afef;">()</span>;</code>
<code>ms.apply<span style="color: #51afef;">(</span><span style="color: #da8548; font-weight: bold;">100</span>, ms.apply<span style="color: #c678dd;">(</span><span style="color: #da8548; font-weight: bold;">42</span>, <span style="color: #da8548; font-weight: bold;">512</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>;</code>
</code></pre>
</div>

</section>
<section id="slide-org0e193a5-split">
<aside class="notes">
<p>
Довольно легко написать функцию свертки на списке полугрупп. Со
следующей сигнатурой:
</p>

</aside>
<div class="org-src-container">

<pre  class="src src-java"><code trim><code><span style="color: #ECBE7B;">Optional</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #c678dd;">sconcat</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">Semigroup</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #c678dd;">&gt;</span> <span style="color: #dcaeea;">semigroup</span>, <span style="color: #ECBE7B;">List</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #c678dd;">&gt;</span> <span style="color: #dcaeea;">list</span><span style="color: #51afef;">)</span></code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="src src-haskell"><code trim><code><span style="color: #c678dd;">sconcat</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Semigroup</span> a <span style="color: #dcaeea;">=&gt;</span> [a] <span style="color: #dcaeea;">-&gt;</span> <span style="color: #ECBE7B;">Maybe</span> a</code>
</code></pre>
</div>

<aside class="notes">
<p>
Сразу бросается в глаза то, что функция sconcat вынуждена возвращать тип
Optional, так как мы можем передать в нее пустой список. С полугруппой
MinIntSemigroup это оправдано, так как не понятно, что нам возвращать в случае
пустого списка. Но, например, для полугруппы StringSemigroup мы бы могли вернуть
пустую строку, а в случае с конфигами - пустой конфиг без параметров. Для этого
нам нужно добавить к бинарной операции еще некий нейтральный элемент и таким
образом мы получаем моноид.
</p>

</aside>

</section>
</section>
<section>
<section id="slide-orgbd5643a">
<h2 id="orgbd5643a">Monoid</h2>
<div class="outline-text-2" id="text-orgbd5643a">
</div>
</section>
<section id="slide-org91c0c79">
<h3 id="org91c0c79">Overview</h3>
<aside class="notes">
<p>
Моноидом называется множество M, на котором задана бинарная ассоциативная
операция, и в котором существует нейтральный элемент e, удовлетворяющий
следующему равенству:
</p>

</aside>

<p>
\[
(G, \cdot  : G \times  G \rightarrow  G)\\
(x \cdot y) \cdot z = x \cdot (y \cdot z)\\
e \cdot x = x \cdot e = x
\]
</p>

</section>
<section id="slide-org91c0c79-split">
<aside class="notes">
<p>
Выразим это в виде Java интерфейса, расширив интерфейс полугруппы, так как по
определению любой моноид также является и полугруппой:
</p>

</aside>
<div class="org-src-container">

<pre  class="src src-java"><code trim><code><span style="color: #51afef;">public</span> <span style="color: #51afef;">interface</span> <span style="color: #ECBE7B;">Monoid</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">A</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">extends</span> <span style="color: #ECBE7B;">Semigroup</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">A</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span></code>
<code>    <span style="color: #ECBE7B;">A</span> <span style="color: #c678dd;">empty</span><span style="color: #c678dd;">()</span>;</code>
<code><span style="color: #51afef;">}</span></code>
</code></pre>
</div>

<aside class="notes">
<p>
И в виде класса типов в Haskell:
</p>

</aside>
<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Semigroup</span> a <span style="color: #dcaeea;">=&gt;</span> <span style="color: #ECBE7B;">Monoid</span> a <span style="color: #51afef;">where</span></code>
<code>  mempty  <span style="color: #dcaeea;">::</span> a</code>
</code></pre>
</div>

</section>
