intro-fp3.org
** Examples
#+BEGIN_NOTES
Приведем примеры моноидов:
#+END_NOTES
#+REVEAL: split
#+BEGIN_SRC java
class StringMonoid implements Monoid<String> {
    public String empty() { return ""; }
    public String apply(String a, String b) {
        return a + b;
    }
}
#+END_SRC

#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC java
class IntSumMonoid implements Monoid<Integer> {
    public Integer empty() { return 0; }
    public Integer apply(Integer a, Integer b) {
        return a + b;
    }
}
#+END_SRC

#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC java
class IntProdMonoid implements Monoid<Integer> {
    public Integer empty() { return 1; }
    public Integer apply(Integer a, Integer b) {
        return a * b;
    }
}
#+END_SRC

#+BEGIN_NOTES
И благодаря нейтральному элементу мы можем реализовать функцию свертки без
использования типа Optional:
#+END_NOTES
#+REVEAL: split
#+BEGIN_SRC java
public static <T> T mconcat(Monoid<T> monoid, List<T> list)
#+END_SRC

#+BEGIN_SRC haskell
mconcat :: [a] -> a
#+END_SRC

#+BEGIN_NOTES
Поскольку бинарная операция принимает два занчения одного типа и в качестве
результата возвращает значение того же типа, то это позволяет нам легко строить
композицию моноидов.
Мы можем из двух моноидов получить один составной, потом добавить к нему третий
и так далее. И в результате мы все равно получим тот же самый моноид, готовый к
дальнейшей композиции.

Моноид как паттерн позволяет нам собрать что-то сложное из простых частей не
вводя дополнительных концепций. А ассоциативность этой операции позволяет нам
разделить применение этой операции по разным потокам или даже разным сервисам.
#+END_NOTES

* Functor
#+REVEAL: split
#+BEGIN_NOTES
Давайте поразмышляем над следующими тремя примерами кода.
TODO: подобрать примеры получше
#+END_NOTES

#+BEGIN_SRC java
Customer customer = findCustomerByName(name);
String city = null;
if (customer != null) {
    city = customer.getAddress().getCity();
}
#+END_SRC

#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC java
List<Customer> customers = findAllCustomers();
List<String> cities = new ArrayList<String>();
for (Customer customer : customers) {
    String city = customer.getAddress().getCity();
    cities.add(city);
}
#+END_SRC

#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC java
Future<Customer> customer = findCustomerByName(name);
String city = customer.get().getAddress().getCity();
#+END_SRC

#+BEGIN_NOTES
У них гораздо больше общего чем может показаться на первый взгляд. Все эти
примеры можно переписать с использованием паттерна Функтор.
#+END_NOTES

