intro-fp3.html
<section id="slide-orgb995b1c">
<h3 id="orgb995b1c">Examples</h3>
<aside class="notes">
<p>
Приведем примеры моноидов:
</p>

</aside>
</section>
<section id="slide-orgb995b1c-split">
<div class="org-src-container">

<pre  class="src src-java"><code trim><code><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">StringMonoid</span> <span style="color: #51afef;">implements</span> <span style="color: #ECBE7B;">Monoid</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">String</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span></code>
<code>    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">String</span> <span style="color: #c678dd;">empty</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span> <span style="color: #51afef;">return</span> <span style="color: #98be65;">""</span>; <span style="color: #c678dd;">}</span></code>
<code>    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">String</span> <span style="color: #c678dd;">apply</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">a</span>, <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">b</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span></code>
<code>        <span style="color: #51afef;">return</span> a + b;</code>
<code>    <span style="color: #c678dd;">}</span></code>
<code><span style="color: #51afef;">}</span></code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">IntSumMonoid</span> <span style="color: #51afef;">implements</span> <span style="color: #ECBE7B;">Monoid</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">Integer</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span></code>
<code>    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">Integer</span> <span style="color: #c678dd;">empty</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span> <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">0</span>; <span style="color: #c678dd;">}</span></code>
<code>    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">Integer</span> <span style="color: #c678dd;">apply</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">Integer</span> <span style="color: #dcaeea;">a</span>, <span style="color: #ECBE7B;">Integer</span> <span style="color: #dcaeea;">b</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span></code>
<code>        <span style="color: #51afef;">return</span> a + b;</code>
<code>    <span style="color: #c678dd;">}</span></code>
<code><span style="color: #51afef;">}</span></code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">IntProdMonoid</span> <span style="color: #51afef;">implements</span> <span style="color: #ECBE7B;">Monoid</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">Integer</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span></code>
<code>    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">Integer</span> <span style="color: #c678dd;">empty</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span> <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #c678dd;">}</span></code>
<code>    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">Integer</span> <span style="color: #c678dd;">apply</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">Integer</span> <span style="color: #dcaeea;">a</span>, <span style="color: #ECBE7B;">Integer</span> <span style="color: #dcaeea;">b</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span></code>
<code>        <span style="color: #51afef;">return</span> a * b;</code>
<code>    <span style="color: #c678dd;">}</span></code>
<code><span style="color: #51afef;">}</span></code>
</code></pre>
</div>

<aside class="notes">
<p>
И благодаря нейтральному элементу мы можем реализовать функцию свертки без
использования типа Optional:
</p>

</aside>
</section>
<section id="slide-orgb995b1c-split">
<div class="org-src-container">

<pre  class="src src-java"><code trim><code><span style="color: #51afef;">public</span> <span style="color: #51afef;">static</span> <span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #ECBE7B;">T</span> <span style="color: #c678dd;">mconcat</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">Monoid</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #c678dd;">&gt;</span> <span style="color: #dcaeea;">monoid</span>, <span style="color: #ECBE7B;">List</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #c678dd;">&gt;</span> <span style="color: #dcaeea;">list</span><span style="color: #51afef;">)</span></code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="src src-haskell"><code trim><code><span style="color: #c678dd;">mconcat</span> <span style="color: #dcaeea;">::</span> [a] <span style="color: #dcaeea;">-&gt;</span> a</code>
</code></pre>
</div>

<aside class="notes">
<p>
Поскольку бинарная операция принимает два занчения одного типа и в качестве
результата возвращает значение того же типа, то это позволяет нам легко строить
композицию моноидов.
Мы можем из двух моноидов получить один составной, потом добавить к нему третий
и так далее. И в результате мы все равно получим тот же самый моноид, готовый к
дальнейшей композиции.
</p>

<p>
Моноид как паттерн позволяет нам собрать что-то сложное из простых частей не
вводя дополнительных концепций. А ассоциативность этой операции позволяет нам
разделить применение этой операции по разным потокам или даже разным сервисам.
</p>

</aside>

</section>
</section>
<section>
<section id="slide-orgeaadc6b">
<h2 id="orgeaadc6b">Functor</h2>
</section>
<section id="slide-orgeaadc6b-split">
<aside class="notes">
<p>
Давайте поразмышляем над следующими тремя примерами кода.
TODO: подобрать примеры получше
</p>

</aside>

<div class="org-src-container">

<pre  class="src src-java"><code trim><code><span style="color: #ECBE7B;">Customer</span> <span style="color: #dcaeea;">customer</span> = findCustomerByName<span style="color: #51afef;">(</span>name<span style="color: #51afef;">)</span>;</code>
<code><span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">city</span> = <span style="color: #a9a1e1;">null</span>;</code>
<code><span style="color: #51afef;">if</span> <span style="color: #51afef;">(</span>customer != <span style="color: #a9a1e1;">null</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span></code>
<code>    city = customer.getAddress<span style="color: #c678dd;">()</span>.getCity<span style="color: #c678dd;">()</span>;</code>
<code><span style="color: #51afef;">}</span></code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #ECBE7B;">List</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">Customer</span><span style="color: #51afef;">&gt;</span> <span style="color: #dcaeea;">customers</span> = findAllCustomers<span style="color: #51afef;">()</span>;</code>
<code><span style="color: #ECBE7B;">List</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">String</span><span style="color: #51afef;">&gt;</span> <span style="color: #dcaeea;">cities</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">ArrayList</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">String</span><span style="color: #51afef;">&gt;()</span>;</code>
<code><span style="color: #51afef;">for</span> <span style="color: #51afef;">(</span><span style="color: #ECBE7B;">Customer</span> <span style="color: #dcaeea;">customer</span> : customers<span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span></code>
<code>    <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">city</span> = customer.getAddress<span style="color: #c678dd;">()</span>.getCity<span style="color: #c678dd;">()</span>;</code>
<code>    cities.add<span style="color: #c678dd;">(</span>city<span style="color: #c678dd;">)</span>;</code>
<code><span style="color: #51afef;">}</span></code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #ECBE7B;">Future</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">Customer</span><span style="color: #51afef;">&gt;</span> <span style="color: #dcaeea;">customer</span> = findCustomerByName<span style="color: #51afef;">(</span>name<span style="color: #51afef;">)</span>;</code>
<code><span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">city</span> = customer.get<span style="color: #51afef;">()</span>.getAddress<span style="color: #51afef;">()</span>.getCity<span style="color: #51afef;">()</span>;</code>
</code></pre>
</div>

<aside class="notes">
<p>
У них гораздо больше общего чем может показаться на первый взгляд. Все эти
примеры можно переписать с использованием паттерна Функтор.
</p>

</aside>

</section>
