intro-fp3.org
** Overview
#+REVEAL: split
#+BEGIN_NOTES
По определению из математики функтор — особый тип отображений между категориями.
Его можно понимать как отображение, сохраняющее структуру.

В Java функтором называют структуру данных, которая инкапсулирует некоторое
значение и имеет метод map со следующей сигнатурой для трансформации этого
значения:
#+END_NOTES
#+BEGIN_SRC java
interface Functor<A> {
    <B> Functor<B> map(Function<A, B> fn);
}
#+END_SRC

#+BEGIN_NOTES
В Haskell функтор определен следующем образом:
#+END_NOTES
#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC haskell
class Functor f where
  fmap :: (a -> b) -> f a -> f b
#+END_SRC
#+BEGIN_NOTES
Это можно прочитать следующим образом:
Тип f принадлежит к классу типов функтор, если для него определена функция fmap,
у которой первый параметр - это функция, принимающая значения типа a и
возвращающая значение типа b, второй параметр - это f параметризованный типом a
и результат - f, параметризованный типом b.

Тип f b - это тип высшего порядка. В Java, это было бы что-то
вроде: F<B>, то есть любой контейнер, который содержит тип B. Таким образом мы
бы получили возможность абстрагироваться не только от типа внутри контейнеров,
но и от типов самих контейнеров. Но к сожалению в Java так сделать нельзя (но
можно сделать в Scala)
#+END_NOTES

** Laws
#+BEGIN_NOTES
Но этого недостаточно, чтобы определить функтор. Как и в случае с моноидом
функтор должен удовлетворять некоторым законам, которые мы не можем выразить в
языках вроде Java или Haskell. Вот эти законы:
#+END_NOTES

\begin{multline}
\shoveleft f : X \rightarrow Y \in C, g : Y \rightarrow Z \in C
\shoveleft F(g \circ f) = F(g) \circ F(f)
\shoveleft F(\text{id}_x)=\text{id}_{F(x)}
\end{multline}

#+REVEAL: split
#+BEGIN_NOTES
Запишем их в виде кода.
1. Вызов функции map с функцией identity должен вернуть тот же самый функтор:
#+END_NOTES
Identity Law
#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC java
functor.map(x -> x) == functor
#+END_SRC

#+BEGIN_NOTES
2. Закон композиции:
#+END_NOTES
#+attr_reveal: :frag (roll-in)
Composition Law
#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC java
functor.map(x -> f(g(x))) == functor.map(g).map(f)
#+END_SRC

#+BEGIN_NOTES
Смысл этих законов сводится к тому, что функция map должна взять содержимое
контейнера, и применить к нему функцию, которую мы передали, при этом не меняя
структуры контейнера.
#+END_NOTES
** Examles
#+BEGIN_NOTES
Рассмотрим самые распространенные примеры функторов.
#+END_NOTES

*** Optional
#+BEGIN_NOTES
Optional это тип данных, который может либо содержать значение, либо нет.
Реализация функции map в этом случае довольно проста. В случае если Optional не
содержит значения - возвращаем пустой Optional. Если значение присутствует -
применяем к нему переданную функцию и возвращаем новый экземпляр Optional с
трансформированным значением.
#+END_NOTES

#+BEGIN_SRC java
class Optional<T> implements Functor<T> {
    private final T value;

    private Optional(T value) {
        this.value = value;
    }

    @Override
    public <R> Optional<R> map(Optional<T, R> f) {
        if (value == null)
            return empty();
        else
            return of(f.apply(value));
    }

    public static <T> Optional<T> of(T a) {
        return new Optional<T>(a);
    }

    public static <T> Optional<T> empty() {
        return new Optional<T>(null);
    }
}
#+END_SRC

#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC java
Optional<Customer> customer = findCustomerByName(name);
Optional<String> city = customer
    .map(Customer::getAddress)
    .map(Address::getCity);
#+END_SRC

#+REVEAL: split
#+BEGIN_SRC haskell
Maybe a = Nothing | Just a
#+END_SRC

#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC haskell
instance Functor Maybe where
    fmap _ Nothing   = Nothing
    fmap f (Just a)  = Just (f a)
#+END_SRC

