intro-fp3.html
<section id="slide-org6cd88c1">
<h3 id="org6cd88c1">Overview</h3>
</section>
<section id="slide-org6cd88c1-split">
<aside class="notes">
<p>
По определению из математики функтор — особый тип отображений между категориями.
Его можно понимать как отображение, сохраняющее структуру.
</p>

<p>
В Java функтором называют структуру данных, которая инкапсулирует некоторое
значение и имеет метод map со следующей сигнатурой для трансформации этого
значения:
</p>

</aside>
<div class="org-src-container">

<pre  class="src src-java"><code trim><code><span style="color: #51afef;">interface</span> <span style="color: #ECBE7B;">Functor</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">A</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span></code>
<code>    <span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">B</span><span style="color: #c678dd;">&gt;</span> <span style="color: #ECBE7B;">Functor</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">B</span><span style="color: #c678dd;">&gt;</span> map<span style="color: #c678dd;">(</span>Function&lt;<span style="color: #ECBE7B;">A</span>, B&gt; fn<span style="color: #c678dd;">)</span>;</code>
<code><span style="color: #51afef;">}</span></code>
</code></pre>
</div>

<aside class="notes">
<p>
В Haskell функтор определен следующем образом:
</p>

</aside>
<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Functor</span> f <span style="color: #51afef;">where</span></code>
<code>  fmap <span style="color: #dcaeea;">::</span> (a <span style="color: #dcaeea;">-&gt;</span> b) <span style="color: #dcaeea;">-&gt;</span> f a <span style="color: #dcaeea;">-&gt;</span> f b</code>
</code></pre>
</div>
<aside class="notes">
<p>
Это можно прочитать следующим образом:
Тип f принадлежит к классу типов функтор, если для него определена функция fmap,
у которой первый параметр - это функция, принимающая значения типа a и
возвращающая значение типа b, второй параметр - это f параметризованный типом a
и результат - f, параметризованный типом b.
</p>

<p>
Тип f b - это тип высшего порядка. В Java, это было бы что-то
вроде: F&lt;B&gt;, то есть любой контейнер, который содержит тип B. Таким образом мы
бы получили возможность абстрагироваться не только от типа внутри контейнеров,
но и от типов самих контейнеров. Но к сожалению в Java так сделать нельзя (но
можно сделать в Scala)
</p>

</aside>

</section>
<section id="slide-org553a9bd">
<h3 id="org553a9bd">Laws</h3>
<aside class="notes">
<p>
Но этого недостаточно, чтобы определить функтор. Как и в случае с моноидом
функтор должен удовлетворять некоторым законам, которые мы не можем выразить в
языках вроде Java или Haskell. Вот эти законы:
</p>

</aside>

<div>
\begin{multline}
\shoveleft f : X \rightarrow Y \in C, g : Y \rightarrow Z \in C
\shoveleft F(g \circ f) = F(g) \circ F(f)
\shoveleft F(\text{id}_x)=\text{id}_{F(x)}
\end{multline}

</div>

</section>
<section id="slide-org553a9bd-split">
<aside class="notes">
<p>
Запишем их в виде кода.
</p>
<ol>
<li>Вызов функции map с функцией identity должен вернуть тот же самый функтор:</li>

</ol>

</aside>
<p>
Identity Law
</p>
<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code>functor.map<span style="color: #51afef;">(</span>x -&gt; x<span style="color: #51afef;">)</span> == functor</code>
</code></pre>
</div>

<aside class="notes">
<ol>
<li>Закон композиции:</li>

</ol>

</aside>
<p class="fragment (roll-in)">
Composition Law
</p>
<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code>functor.map<span style="color: #51afef;">(</span>x -&gt; f<span style="color: #c678dd;">(</span>g<span style="color: #98be65;">(</span>x<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span> == functor.map<span style="color: #51afef;">(</span>g<span style="color: #51afef;">)</span>.map<span style="color: #51afef;">(</span>f<span style="color: #51afef;">)</span></code>
</code></pre>
</div>

<aside class="notes">
<p>
Смысл этих законов сводится к тому, что функция map должна взять содержимое
контейнера, и применить к нему функцию, которую мы передали, при этом не меняя
структуры контейнера.
</p>

</aside>
</section>
<section id="slide-org82ea145">
<h3 id="org82ea145">Examles</h3>
<aside class="notes">
<p>
Рассмотрим самые распространенные примеры функторов.
</p>

</aside>

</section>
<section id="slide-org69532f7">
<h4 id="org69532f7">Optional</h4>
<aside class="notes">
<p>
Optional это тип данных, который может либо содержать значение, либо нет.
Реализация функции map в этом случае довольно проста. В случае если Optional не
содержит значения - возвращаем пустой Optional. Если значение присутствует -
применяем к нему переданную функцию и возвращаем новый экземпляр Optional с
трансформированным значением.
</p>

</aside>

<div class="org-src-container">

<pre  class="src src-java"><code trim><code><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Optional</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">implements</span> <span style="color: #ECBE7B;">Functor</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span></code>
<code>    <span style="color: #51afef;">private</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">T</span> <span style="color: #dcaeea;">value</span>;</code>
<code></code>
<code>    <span style="color: #51afef;">private</span> <span style="color: #c678dd;">Optional</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">T</span> <span style="color: #dcaeea;">value</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span></code>
<code>        <span style="color: #51afef;">this</span>.value = value;</code>
<code>    <span style="color: #c678dd;">}</span></code>
<code></code>
<code>    <span style="color: #a9a1e1;">@Override</span></code>
<code>    <span style="color: #51afef;">public</span> <span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">R</span><span style="color: #c678dd;">&gt;</span> <span style="color: #ECBE7B;">Optional</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">R</span><span style="color: #c678dd;">&gt;</span> <span style="color: #c678dd;">map</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">Optional</span><span style="color: #98be65;">&lt;</span><span style="color: #ECBE7B;">T</span>, <span style="color: #ECBE7B;">R</span><span style="color: #98be65;">&gt;</span> <span style="color: #dcaeea;">f</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span></code>
<code>        <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span>value == <span style="color: #a9a1e1;">null</span><span style="color: #98be65;">)</span></code>
<code>            <span style="color: #51afef;">return</span> empty<span style="color: #98be65;">()</span>;</code>
<code>        <span style="color: #51afef;">else</span></code>
<code>            <span style="color: #51afef;">return</span> of<span style="color: #98be65;">(</span>f.apply<span style="color: #51afef;">(</span>value<span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>;</code>
<code>    <span style="color: #c678dd;">}</span></code>
<code></code>
<code>    <span style="color: #51afef;">public</span> <span style="color: #51afef;">static</span> <span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #c678dd;">&gt;</span> <span style="color: #ECBE7B;">Optional</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #c678dd;">&gt;</span> <span style="color: #c678dd;">of</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">T</span> <span style="color: #dcaeea;">a</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span></code>
<code>        <span style="color: #51afef;">return</span> <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Optional</span><span style="color: #98be65;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #98be65;">&gt;(</span>a<span style="color: #98be65;">)</span>;</code>
<code>    <span style="color: #c678dd;">}</span></code>
<code></code>
<code>    <span style="color: #51afef;">public</span> <span style="color: #51afef;">static</span> <span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #c678dd;">&gt;</span> <span style="color: #ECBE7B;">Optional</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #c678dd;">&gt;</span> <span style="color: #c678dd;">empty</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span></code>
<code>        <span style="color: #51afef;">return</span> <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Optional</span><span style="color: #98be65;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #98be65;">&gt;(</span><span style="color: #a9a1e1;">null</span><span style="color: #98be65;">)</span>;</code>
<code>    <span style="color: #c678dd;">}</span></code>
<code><span style="color: #51afef;">}</span></code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #ECBE7B;">Optional</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">Customer</span><span style="color: #51afef;">&gt;</span> <span style="color: #dcaeea;">customer</span> = findCustomerByName<span style="color: #51afef;">(</span>name<span style="color: #51afef;">)</span>;</code>
<code><span style="color: #ECBE7B;">Optional</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">String</span><span style="color: #51afef;">&gt;</span> <span style="color: #dcaeea;">city</span> = customer</code>
<code>    .map<span style="color: #51afef;">(</span>Customer::getAddress<span style="color: #51afef;">)</span></code>
<code>    .map<span style="color: #51afef;">(</span>Address::getCity<span style="color: #51afef;">)</span>;</code>
</code></pre>
</div>

</section>
<section id="slide-org69532f7-split">
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><code><span style="color: #ECBE7B;">Maybe</span> a <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Nothing</span> <span style="color: #dcaeea;">|</span> <span style="color: #ECBE7B;">Just</span> a</code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #51afef;">instance</span> <span style="color: #ECBE7B;">Functor</span> <span style="color: #ECBE7B;">Maybe</span> <span style="color: #51afef;">where</span></code>
<code>    fmap <span style="color: #51afef;">_</span> <span style="color: #ECBE7B;">Nothing</span>   <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Nothing</span></code>
<code>    fmap f (<span style="color: #ECBE7B;">Just</span> a)  <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Just</span> (f a)</code>
</code></pre>
</div>

</section>
