intro-fp3.org
*** List
#+BEGIN_NOTES
Функтор не обязан содержать только одно значение, например список также является
функтором. Сигнатура функции map остается прежней, но ее поведение меняется. В
случае списка map применяет функцию трансформации к каждому элементу, возвращая
новый список.
#+END_NOTES
#+BEGIN_SRC java
class FList<T> extends ArrayList<T> implements Functor<T> {

    @Override
    public <R> FList<R> map(Function<T, R> f) {
        FList<R> result = new FList<>();
        for (int i = 0; i < size(); i++) {
            R newElement = f.apply(get(i));
            result.add(newElement);
        }
        return result;
    }
}
 #+END_SRC

#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC java
FList<Customer> customers = getAllCustomers();
FList<String> cities = customers
    .map(Customer::getAddress)
    .map(Address::getCity);
#+END_SRC

*** Promise
#+BEGIN_NOTES
Определение функтора не накладывает никаких ограничений ни на структуру
контейнера, ни на то как значение в него попадает или как его достать от туда. Функтор
вообще может не содержать никакого значения в данный момент, а получать его
позже. Например, функтор можно имплементировать для класса Future<T>. При
создании объекта Future<T> в нем нет никакого значения, оно там появится когда
завершиться какое-то действие. Выполнится http запрос к внешнему
сервису или чтение из БД. Но это не мешает нам применять
трансформации к этому еще не полученному
значению через функцию map, так же как мы делали это с List и Optional. При этом
функция map не блокирует поток, ожидая появления значения. Таким образом мы можем
строить цепочки неблокирующих вычислений.
#+END_NOTES
#+BEGIN_SRC java
class Promise<T> implements Functor<T> {
    public <R> Promise<R> map(Function<T, R> f) { ... }
}
#+END_SRC

#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC java
Promise<Customer> customer = customerServiceApi.getCustomerById(id);
Promise<String> city = customer
    .map(Customer::getAddress)
    .map(Address::getCity);
#+END_SRC

#+BEGIN_NOTES
По приведенным выше примерам функторов можно заметить на сколько это мощная
абстракция. Мы использовали один и тот же интерфейс для реализации цепочки отложенных
вычислений, трансформации всех элементов списка и работы с неопределенным значением.
#+END_NOTES

* TODO Monad
#+BEGIN_NOTES
Функтор удобный и часто используемый паттерн, но в некоторых ситуациях он нам не
подходит. Например, когда функция трансформации сама возвращает функтор вместо
обычного значения.
#+END_NOTES

#+BEGIN_SRC java
public Optional<Manager> findLocalManager(String city) { ... }

//...
Optional<Customer> customer = findCustomerByName(name);
Optional<Optional<Manager>> manager = customer
    .map(Customer::getAddress)
    .map(Address::getCity)
    .map(city -> findLocalManager(city));
#+END_SRC

#+BEGIN_NOTES
Если мы воспользуемся функцией map, то в результате получим тип
Optional<Optional<Manager>> с которым потом не понятно что делать.

Функция map из определения функтора имеет следующую сигнатуру:
#+END_NOTES

#+REVEAL: split
#+BEGIN_SRC haskell
(a -> b) -> f a -> f b
#+END_SRC

#+BEGIN_NOTES
Нам же нужна функция со следующей сигнатурой:
#+END_NOTES

#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC haskell
(a -> f b) -> f a -> f b
#+END_SRC

#+BEGIN_NOTES
И ее мы найдем в классе типов монада
#+END_NOTES
