intro-fp3.html
<section id="slide-orgdec1d0f">
<h4 id="orgdec1d0f">List</h4>
<aside class="notes">
<p>
Функтор не обязан содержать только одно значение, например список также является
функтором. Сигнатура функции map остается прежней, но ее поведение меняется. В
случае списка map применяет функцию трансформации к каждому элементу, возвращая
новый список.
</p>

</aside>
<div class="org-src-container">

<pre  class="src src-java"><code trim><code><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">FList</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">extends</span> <span style="color: #ECBE7B;">ArrayList</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">implements</span> <span style="color: #ECBE7B;">Functor</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span></code>
<code></code>
<code>    <span style="color: #a9a1e1;">@Override</span></code>
<code>    <span style="color: #51afef;">public</span> <span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">R</span><span style="color: #c678dd;">&gt;</span> <span style="color: #ECBE7B;">FList</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">R</span><span style="color: #c678dd;">&gt;</span> <span style="color: #c678dd;">map</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">Function</span><span style="color: #98be65;">&lt;</span><span style="color: #ECBE7B;">T</span>, <span style="color: #ECBE7B;">R</span><span style="color: #98be65;">&gt;</span> <span style="color: #dcaeea;">f</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span></code>
<code>        <span style="color: #ECBE7B;">FList</span><span style="color: #98be65;">&lt;</span><span style="color: #ECBE7B;">R</span><span style="color: #98be65;">&gt;</span> <span style="color: #dcaeea;">result</span> = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">FList</span><span style="color: #98be65;">&lt;&gt;()</span>;</code>
<code>        <span style="color: #51afef;">for</span> <span style="color: #98be65;">(</span><span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span> = <span style="color: #da8548; font-weight: bold;">0</span>; i &lt; <span style="color: #ECBE7B;">size</span><span style="color: #51afef;">()</span>; i++<span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span></code>
<code>            <span style="color: #ECBE7B;">R</span> <span style="color: #dcaeea;">newElement</span> = f.apply<span style="color: #51afef;">(</span>get<span style="color: #c678dd;">(</span>i<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>;</code>
<code>            result.add<span style="color: #51afef;">(</span>newElement<span style="color: #51afef;">)</span>;</code>
<code>        <span style="color: #98be65;">}</span></code>
<code>        <span style="color: #51afef;">return</span> result;</code>
<code>    <span style="color: #c678dd;">}</span></code>
<code><span style="color: #51afef;">}</span></code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #ECBE7B;">FList</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">Customer</span><span style="color: #51afef;">&gt;</span> <span style="color: #dcaeea;">customers</span> = getAllCustomers<span style="color: #51afef;">()</span>;</code>
<code><span style="color: #ECBE7B;">FList</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">String</span><span style="color: #51afef;">&gt;</span> <span style="color: #dcaeea;">cities</span> = customers</code>
<code>    .map<span style="color: #51afef;">(</span>Customer::getAddress<span style="color: #51afef;">)</span></code>
<code>    .map<span style="color: #51afef;">(</span>Address::getCity<span style="color: #51afef;">)</span>;</code>
</code></pre>
</div>

</section>
<section id="slide-orgf6e1d62">
<h4 id="orgf6e1d62">Promise</h4>
<aside class="notes">
<p>
Определение функтора не накладывает никаких ограничений ни на структуру
контейнера, ни на то как значение в него попадает или как его достать от туда. Функтор
вообще может не содержать никакого значения в данный момент, а получать его
позже. Например, функтор можно имплементировать для класса Future&lt;T&gt;. При
создании объекта Future&lt;T&gt; в нем нет никакого значения, оно там появится когда
завершиться какое-то действие. Выполнится http запрос к внешнему
сервису или чтение из БД. Но это не мешает нам применять
трансформации к этому еще не полученному
значению через функцию map, так же как мы делали это с List и Optional. При этом
функция map не блокирует поток, ожидая появления значения. Таким образом мы можем
строить цепочки неблокирующих вычислений.
</p>

</aside>
<div class="org-src-container">

<pre  class="src src-java"><code trim><code><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Promise</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">implements</span> <span style="color: #ECBE7B;">Functor</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span></code>
<code>    <span style="color: #51afef;">public</span> <span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">R</span><span style="color: #c678dd;">&gt;</span> <span style="color: #ECBE7B;">Promise</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">R</span><span style="color: #c678dd;">&gt;</span> <span style="color: #c678dd;">map</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">Function</span><span style="color: #98be65;">&lt;</span><span style="color: #ECBE7B;">T</span>, <span style="color: #ECBE7B;">R</span><span style="color: #98be65;">&gt;</span> <span style="color: #dcaeea;">f</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span> ... <span style="color: #c678dd;">}</span></code>
<code><span style="color: #51afef;">}</span></code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #ECBE7B;">Promise</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">Customer</span><span style="color: #51afef;">&gt;</span> <span style="color: #dcaeea;">customer</span> = customerServiceApi.getCustomerById<span style="color: #51afef;">(</span>id<span style="color: #51afef;">)</span>;</code>
<code><span style="color: #ECBE7B;">Promise</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">String</span><span style="color: #51afef;">&gt;</span> <span style="color: #dcaeea;">city</span> = customer</code>
<code>    .map<span style="color: #51afef;">(</span>Customer::getAddress<span style="color: #51afef;">)</span></code>
<code>    .map<span style="color: #51afef;">(</span>Address::getCity<span style="color: #51afef;">)</span>;</code>
</code></pre>
</div>

<aside class="notes">
<p>
По приведенным выше примерам функторов можно заметить на сколько это мощная
абстракция. Мы использовали один и тот же интерфейс для реализации цепочки отложенных
вычислений, трансформации всех элементов списка и работы с неопределенным значением.
</p>

</aside>

</section>
</section>
<section>
<section id="slide-orgd3f938e">
<h2 id="orgd3f938e"><span class="todo TODO">TODO</span> Monad</h2>
<aside class="notes">
<p>
Функтор удобный и часто используемый паттерн, но в некоторых ситуациях он нам не
подходит. Например, когда функция трансформации сама возвращает функтор вместо
обычного значения.
</p>

</aside>

<div class="org-src-container">

<pre  class="src src-java"><code trim><code><span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">Optional</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">Manager</span><span style="color: #51afef;">&gt;</span> <span style="color: #c678dd;">findLocalManager</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">city</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span> ... <span style="color: #51afef;">}</span></code>
<code></code>
<code><span style="color: #5B6268;">//</span><span style="color: #5B6268;">...</span></code>
<code><span style="color: #ECBE7B;">Optional</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">Customer</span><span style="color: #51afef;">&gt;</span> <span style="color: #dcaeea;">customer</span> = findCustomerByName<span style="color: #51afef;">(</span>name<span style="color: #51afef;">)</span>;</code>
<code><span style="color: #ECBE7B;">Optional</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">Optional</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">Manager</span><span style="color: #c678dd;">&gt;</span><span style="color: #51afef;">&gt;</span> <span style="color: #dcaeea;">manager</span> = customer</code>
<code>    .map<span style="color: #51afef;">(</span>Customer::getAddress<span style="color: #51afef;">)</span></code>
<code>    .map<span style="color: #51afef;">(</span>Address::getCity<span style="color: #51afef;">)</span></code>
<code>    .map<span style="color: #51afef;">(</span>city -&gt; findLocalManager<span style="color: #c678dd;">(</span>city<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>;</code>
</code></pre>
</div>

<aside class="notes">
<p>
Если мы воспользуемся функцией map, то в результате получим тип
Optional&lt;Optional&lt;Manager&gt;&gt; с которым потом не понятно что делать.
</p>

<p>
Функция map из определения функтора имеет следующую сигнатуру:
</p>

</aside>

</section>
<section id="slide-orgd3f938e-split">
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><code>(a <span style="color: #dcaeea;">-&gt;</span> b) <span style="color: #dcaeea;">-&gt;</span> f a <span style="color: #dcaeea;">-&gt;</span> f b</code>
</code></pre>
</div>

<aside class="notes">
<p>
Нам же нужна функция со следующей сигнатурой:
</p>

</aside>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code>(a <span style="color: #dcaeea;">-&gt;</span> f b) <span style="color: #dcaeea;">-&gt;</span> f a <span style="color: #dcaeea;">-&gt;</span> f b</code>
</code></pre>
</div>

<aside class="notes">
<p>
И ее мы найдем в классе типов монада
</p>

</aside>
</section>
