intro-fp3.org
** Overview
#+BEGIN_NOTES
Монада — это общий способ описать идею последовательных вычислений, которые
можно соединять вместе так, чтобы от результата предыдущего вычисления зависело
следующее.

С точки зрения программирования монада это тип данных с одним параметром,
обладающим двумя функциями: Функцией конструктором (unit/pure/return), которая
оборачивает некоторое значение в монаду. И функцией связывания (flatMap/bind).
Как и рассмотренные ранее паттерны монада должна удовлетворять некоторым
законам, знакомство с которыми мы оставим за рамками этой презентации.

Интерфейс Monad может выглядеть на Java следующим образом:
#+END_NOTES

#+BEGIN_SRC java
public interface Monad<T, M extends Monad<?, ?>> extends Functor<T> {
    M flatMap(Function<T, M> f);
}
#+END_SRC

** Examples
