intro-fp3.org
*** Optional
#+BEGIN_NOTES
Попробуем написать имплиментацию этого интерфейса для Optional
#+END_NOTES

#+BEGIN_LARGE_SRC
#+BEGIN_SRC java
class Optional<T> implements Monad<T, Optional<T>> {
    private final T value;

    private Optional(T value) {
        this.value = value;
    }

    public static <T> Optional<T> of(T a) {
        return new Optional<>(a);
    }

    public static <T> Optional<T> empty() {
        return new Optional<>(null);
    }

    @Override
    public <B> Optional<B> map(Function<T, B> fn) {
        if (value == null)
            return empty();
        else
            return of(fn.apply(value));
    }

    @Override
    public Optional<T> flatMap(Function<T, Optional<T>> fn) {
        if (value == null)
            return empty();
        else
            return fn.apply(value);
    }
}
#+END_SRC
#+END_LARGE_SRC

#+BEGIN_NOTES
Вернемся к нашему примеру, где мы хотели найти менеджера для клиента. Теперь он
будет выглядеть так:
#+END_NOTES

#+REVEAL: split
#+BEGIN_SRC java
public Optional<Manager> findLocalManager(String city) { ... }

//...
Optional<Customer> customer = findCustomerByName(name);
Optional<Manager> manager = customer
    .map(Customer::getAddress)
    .map(Address::getCity)
    .flatMap(this::findLocalManager);
#+END_SRC

#+BEGIN_NOTES
И если потребуется, то можно с легкостью продолжить эту цепочку. Например, таким
образом мы можем безопасно добраться до глубоко вложенных полей в структурах:
#+END_NOTES

#+REVEAL: split
#+BEGIN_SRC java
class Person {
    private PersonalData personalData;
}

class PersonalData {
    private Contact contact;
}

class Contact {
    private Address address;
}

class Address {
    private String city;
}
#+END_SRC

#+BEGIN_NOTES
Во первых понять по этой структуре какие поля обязательные, а какие нет -
невозможно, так что будем считать что null может быть в любом поле и теперь
хотим у человека получить город проживания. Для этого нам придется написать
что-то вроде:
#+END_NOTES

#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC java
String city = null;
if (person.getPersonalData() != null
    && person.getPersonalData().getContact() != null
    && person.getPersonalData().getContact().getAddress() != null) {
    city = person.getPersonalData().getContact().getAddress().getCity();
}
#+END_SRC

#+BEGIN_NOTES
Выглядит этот код хоть и привычно, но во-первых в нем можно допустить ошибку,
во-вторых он наполнен визуальным мусором, который мешает понимать его суть.
Давайте перепишем этот пример с использованием Optional:
#+END_NOTES

#+REVEAL: split
#+BEGIN_SRC java
class Person {
    private Optional<PersonalData> personalData;
}

class PersonalData {
    private Optional<Contact> contact;
}

class Contact {
    private Optional<Address> address;
}

class Address {
    private String city;
}
#+END_SRC

#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC java
Optional<String> city = person.getPersonalData()
    .flatMap(PersonalData::getContact)
    .flatMap(Contact::getAddress)
    .map(Address::getCity);
#+END_SRC
#+BEGIN_NOTES
На мой взгляд теперь из кода явно видно что мы хотим сделать, компилятор
защищает нас от ошибок а типы стали частью документации к коду.
#+END_NOTES

