intro-fp3.html
<section id="slide-org3f3116c">
<h3 id="org3f3116c">Examples</h3>
<div class="outline-text-3" id="text-org3f3116c">
</div>
</section>
<section id="slide-orga0ecaf7">
<h4 id="orga0ecaf7">Optional</h4>
<aside class="notes">
<p>
Попробуем написать имплиментацию этого интерфейса для Optional
</p>

</aside>

<div class="LARGE_SRC">
<div class="org-src-container">

<pre  class="src src-java"><code trim><code><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Optional</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">implements</span> <span style="color: #ECBE7B;">Monad</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span>, <span style="color: #ECBE7B;">Optional</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #c678dd;">&gt;</span><span style="color: #51afef;">&gt;</span> <span style="color: #51afef;">{</span></code>
<code>    <span style="color: #51afef;">private</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">T</span> <span style="color: #dcaeea;">value</span>;</code>
<code></code>
<code>    <span style="color: #51afef;">private</span> <span style="color: #c678dd;">Optional</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">T</span> <span style="color: #dcaeea;">value</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span></code>
<code>        <span style="color: #51afef;">this</span>.value = value;</code>
<code>    <span style="color: #c678dd;">}</span></code>
<code></code>
<code>    <span style="color: #51afef;">public</span> <span style="color: #51afef;">static</span> <span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #c678dd;">&gt;</span> <span style="color: #ECBE7B;">Optional</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #c678dd;">&gt;</span> <span style="color: #c678dd;">of</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">T</span> <span style="color: #dcaeea;">a</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span></code>
<code>        <span style="color: #51afef;">return</span> <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Optional</span><span style="color: #98be65;">&lt;&gt;(</span>a<span style="color: #98be65;">)</span>;</code>
<code>    <span style="color: #c678dd;">}</span></code>
<code></code>
<code>    <span style="color: #51afef;">public</span> <span style="color: #51afef;">static</span> <span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #c678dd;">&gt;</span> <span style="color: #ECBE7B;">Optional</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #c678dd;">&gt;</span> <span style="color: #c678dd;">empty</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span></code>
<code>        <span style="color: #51afef;">return</span> <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Optional</span><span style="color: #98be65;">&lt;&gt;(</span><span style="color: #a9a1e1;">null</span><span style="color: #98be65;">)</span>;</code>
<code>    <span style="color: #c678dd;">}</span></code>
<code></code>
<code>    <span style="color: #a9a1e1;">@Override</span></code>
<code>    <span style="color: #51afef;">public</span> <span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">B</span><span style="color: #c678dd;">&gt;</span> <span style="color: #ECBE7B;">Optional</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">B</span><span style="color: #c678dd;">&gt;</span> <span style="color: #c678dd;">map</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">Function</span><span style="color: #98be65;">&lt;</span><span style="color: #ECBE7B;">T</span>, <span style="color: #ECBE7B;">B</span><span style="color: #98be65;">&gt;</span> <span style="color: #dcaeea;">fn</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span></code>
<code>        <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span>value == <span style="color: #a9a1e1;">null</span><span style="color: #98be65;">)</span></code>
<code>            <span style="color: #51afef;">return</span> empty<span style="color: #98be65;">()</span>;</code>
<code>        <span style="color: #51afef;">else</span></code>
<code>            <span style="color: #51afef;">return</span> of<span style="color: #98be65;">(</span>fn.apply<span style="color: #51afef;">(</span>value<span style="color: #51afef;">)</span><span style="color: #98be65;">)</span>;</code>
<code>    <span style="color: #c678dd;">}</span></code>
<code></code>
<code>    <span style="color: #a9a1e1;">@Override</span></code>
<code>    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">Optional</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #c678dd;">&gt;</span> <span style="color: #c678dd;">flatMap</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">Function</span><span style="color: #98be65;">&lt;</span><span style="color: #ECBE7B;">T</span>, <span style="color: #ECBE7B;">Optional</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">T</span><span style="color: #51afef;">&gt;</span><span style="color: #98be65;">&gt;</span> <span style="color: #dcaeea;">fn</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span></code>
<code>        <span style="color: #51afef;">if</span> <span style="color: #98be65;">(</span>value == <span style="color: #a9a1e1;">null</span><span style="color: #98be65;">)</span></code>
<code>            <span style="color: #51afef;">return</span> empty<span style="color: #98be65;">()</span>;</code>
<code>        <span style="color: #51afef;">else</span></code>
<code>            <span style="color: #51afef;">return</span> fn.apply<span style="color: #98be65;">(</span>value<span style="color: #98be65;">)</span>;</code>
<code>    <span style="color: #c678dd;">}</span></code>
<code><span style="color: #51afef;">}</span></code>
</code></pre>
</div>

</div>

<aside class="notes">
<p>
Вернемся к нашему примеру, где мы хотели найти менеджера для клиента. Теперь он
будет выглядеть так:
</p>

</aside>

</section>
<section id="slide-orga0ecaf7-split">
<div class="org-src-container">

<pre  class="src src-java"><code trim><code><span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">Optional</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">Manager</span><span style="color: #51afef;">&gt;</span> <span style="color: #c678dd;">findLocalManager</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">city</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span> ... <span style="color: #51afef;">}</span></code>
<code></code>
<code><span style="color: #5B6268;">//</span><span style="color: #5B6268;">...</span></code>
<code><span style="color: #ECBE7B;">Optional</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">Customer</span><span style="color: #51afef;">&gt;</span> <span style="color: #dcaeea;">customer</span> = findCustomerByName<span style="color: #51afef;">(</span>name<span style="color: #51afef;">)</span>;</code>
<code><span style="color: #ECBE7B;">Optional</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">Manager</span><span style="color: #51afef;">&gt;</span> <span style="color: #dcaeea;">manager</span> = customer</code>
<code>    .map<span style="color: #51afef;">(</span>Customer::getAddress<span style="color: #51afef;">)</span></code>
<code>    .map<span style="color: #51afef;">(</span>Address::getCity<span style="color: #51afef;">)</span></code>
<code>    .flatMap<span style="color: #51afef;">(</span><span style="color: #51afef;">this</span>::findLocalManager<span style="color: #51afef;">)</span>;</code>
</code></pre>
</div>

<aside class="notes">
<p>
И если потребуется, то можно с легкостью продолжить эту цепочку. Например, таким
образом мы можем безопасно добраться до глубоко вложенных полей в структурах:
</p>

</aside>

</section>
<section id="slide-orga0ecaf7-split">
<div class="org-src-container">

<pre  class="src src-java"><code trim><code><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Person</span> <span style="color: #51afef;">{</span></code>
<code>    <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">PersonalData</span> <span style="color: #dcaeea;">personalData</span>;</code>
<code><span style="color: #51afef;">}</span></code>
<code></code>
<code><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">PersonalData</span> <span style="color: #51afef;">{</span></code>
<code>    <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">Contact</span> <span style="color: #dcaeea;">contact</span>;</code>
<code><span style="color: #51afef;">}</span></code>
<code></code>
<code><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Contact</span> <span style="color: #51afef;">{</span></code>
<code>    <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">Address</span> <span style="color: #dcaeea;">address</span>;</code>
<code><span style="color: #51afef;">}</span></code>
<code></code>
<code><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Address</span> <span style="color: #51afef;">{</span></code>
<code>    <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">city</span>;</code>
<code><span style="color: #51afef;">}</span></code>
</code></pre>
</div>

<aside class="notes">
<p>
Во первых понять по этой структуре какие поля обязательные, а какие нет -
невозможно, так что будем считать что null может быть в любом поле и теперь
хотим у человека получить город проживания. Для этого нам придется написать
что-то вроде:
</p>

</aside>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">city</span> = <span style="color: #a9a1e1;">null</span>;</code>
<code><span style="color: #51afef;">if</span> <span style="color: #51afef;">(</span>person.getPersonalData<span style="color: #c678dd;">()</span> != <span style="color: #a9a1e1;">null</span></code>
<code>    &amp;&amp; person.getPersonalData<span style="color: #c678dd;">()</span>.getContact<span style="color: #c678dd;">()</span> != <span style="color: #a9a1e1;">null</span></code>
<code>    &amp;&amp; person.getPersonalData<span style="color: #c678dd;">()</span>.getContact<span style="color: #c678dd;">()</span>.getAddress<span style="color: #c678dd;">()</span> != <span style="color: #a9a1e1;">null</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span></code>
<code>    city = person.getPersonalData<span style="color: #c678dd;">()</span>.getContact<span style="color: #c678dd;">()</span>.getAddress<span style="color: #c678dd;">()</span>.getCity<span style="color: #c678dd;">()</span>;</code>
<code><span style="color: #51afef;">}</span></code>
</code></pre>
</div>

<aside class="notes">
<p>
Выглядит этот код хоть и привычно, но во-первых в нем можно допустить ошибку,
во-вторых он наполнен визуальным мусором, который мешает понимать его суть.
Давайте перепишем этот пример с использованием Optional:
</p>

</aside>

</section>
<section id="slide-orga0ecaf7-split">
<div class="org-src-container">

<pre  class="src src-java"><code trim><code><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Person</span> <span style="color: #51afef;">{</span></code>
<code>    <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">Optional</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">PersonalData</span><span style="color: #c678dd;">&gt;</span> <span style="color: #dcaeea;">personalData</span>;</code>
<code><span style="color: #51afef;">}</span></code>
<code></code>
<code><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">PersonalData</span> <span style="color: #51afef;">{</span></code>
<code>    <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">Optional</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">Contact</span><span style="color: #c678dd;">&gt;</span> <span style="color: #dcaeea;">contact</span>;</code>
<code><span style="color: #51afef;">}</span></code>
<code></code>
<code><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Contact</span> <span style="color: #51afef;">{</span></code>
<code>    <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">Optional</span><span style="color: #c678dd;">&lt;</span><span style="color: #ECBE7B;">Address</span><span style="color: #c678dd;">&gt;</span> <span style="color: #dcaeea;">address</span>;</code>
<code><span style="color: #51afef;">}</span></code>
<code></code>
<code><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Address</span> <span style="color: #51afef;">{</span></code>
<code>    <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">city</span>;</code>
<code><span style="color: #51afef;">}</span></code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #ECBE7B;">Optional</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">String</span><span style="color: #51afef;">&gt;</span> <span style="color: #dcaeea;">city</span> = person.getPersonalData<span style="color: #51afef;">()</span></code>
<code>    .flatMap<span style="color: #51afef;">(</span>PersonalData::getContact<span style="color: #51afef;">)</span></code>
<code>    .flatMap<span style="color: #51afef;">(</span>Contact::getAddress<span style="color: #51afef;">)</span></code>
<code>    .map<span style="color: #51afef;">(</span>Address::getCity<span style="color: #51afef;">)</span>;</code>
</code></pre>
</div>
<aside class="notes">
<p>
На мой взгляд теперь из кода явно видно что мы хотим сделать, компилятор
защищает нас от ошибок а типы стали частью документации к коду.
</p>

</aside>

</section>
