intro-fp3.org
*** Promise
#+BEGIN_NOTES
Давайте посмотрим на функции ниже и подумаем как нам сделать следующее: получить
клиента по имени, потом по его адресу найти менеджера и запланировать между ними
встречу. И сделать все это асинхронно, без блокировок.
#+END_NOTES
#+BEGIN_SRC java
public Promise<Customer> getCustomerByName(String name) { ... }
public Promise<Manager> getLocalManager(Address customerAddress) { ... }
public Promise<Meeting> scheduleMeeting(Manager manager, Customer customer) { ... }
#+END_SRC

#+BEGIN_NOTES
На самом деле для этого нам не нужно ничего знать кроме того что Promise также
является монадой. Сделать то что мы хотим можно следующим образом:
#+END_NOTES
#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC java
Promise<Meeting> meeting = getCustomerByName(name)
    .flatMap(customer ->
             getLocalManager(customer.getAddress())
                 .flatMap(manager ->
                          scheduleMeeting(manager, customer)));
#+END_SRC

#+BEGIN_NOTES
Таким образом мы можем строить цепочки связанных асинхронных вызовов не
используя коллбеки или какие-то дополнительные инструменты синхронизации.
#+END_NOTES
*** For comprehension
#+BEGIN_NOTES
В Haskell и Scala монады настолько распространены, что существует специальный
синтаксис для композиции монадических функций. Благодаря ему можно переписать
этот код:
#+END_NOTES
#+REVEAL: split
#+BEGIN_SRC scala
val meeting = getCustomerByName(name)
  .flatMap(customer =>
      getLocalManager(customer.address)
        .flatMap(manager =>
          scheduleMeeting(manager, customer))
  )
#+END_SRC

#+BEGIN_NOTES
Вот так:
#+END_NOTES
#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC scala
val meeting = for {
  customer <- getCustomerByName(name)
  manager <- getLocalManager(customer.address)
  meeting <- scheduleMeeting(manager, customer)
} yield meeting
#+END_SRC

#+BEGIN_NOTES
В Scala такая форма записи называется for-comprehension
#+END_NOTES
#+REVEAL: split

#+BEGIN_NOTES
Either?
#+END_NOTES

* End
#+BEGIN_NOTES
Абстракции крайне важны. В принципе все чем мы занимаемся в программировании -
это проектирование абстракций и взаимодействий между ними. К признакам хороших
абстракций можно отнести возможность комбинировать их друг с другом и
универсальность, то есть количество разных вещей, которые можно выразить через
абстракцию.

У математиков очень большой опыт в построении и использовании абстракций. И
поскольку язык Хаскелл был разработан математиками, то нет ничего удивительного
что в нем используются знакомые математикам и проверенные временем абстракции. И
дальше они уже потихоньку протекают в мейнстрим языки программирования.






Это позволяет рассуждать о коде,  в чем и должны помогать паттерны. Только в отличие от ооп и 3ех разновидностей стнглтонов под этими паттернами есть матиматическое основание. И строгие поавила что является моноидом, а что нет. При этом эти правила хоть и не требуются еа уровне языка, зотя бы можно проверитб юнит тестом.

Слыша слово моноид я понимаю что это что-то что я могу заредюсить и при этом сделать это параллельно
Свойство ассоциативности кажется таким не существенным, но оно очень мощное.

Семигруппа - значит можем параллелить или асинхронно обробатовать батчами
Моноид - можем делать фолд A functor is a way to apply a function over or around
some structure that we don’t want to alter. That is, we want to apply the
function to the value that is “inside” some structure and leave the structure
alone.

То же самое с декомпозицией большой задачи. Мой опыт показывает, что чем меньше
контекста нужно держать в голове для осознания одной строчки кода, тем проще её
понять. В Haskell все направлено на то, чтобы этот контекст сделать как можно
меньше, то есть, чтобы не думать. Чистые функции — чтобы не думать о посторонних
эффектах. Иммутабельность — чтобы не думать, где переменная могла измениться.
Типы — чтобы не думать, какую экзотику могут скормить в нашу функцию.
Полиморфизм — чтобы вообще не думать о конкретных значениях, а думать о
действиях. Разделение контекста и значений на уровне типов — чтобы не думать,
какую часть внешнего мира изменит вызов этой функции. Алгебраические типы данных
— чтобы не думать обо всех случаях и сценариях сразу. Ряд можно продолжать долго
#+END_NOTES

* Trash

#+REVEAL: split
#+BEGIN_SRC haskell
class Functor m => Monad m where
    (>>=)   :: m a -> (a -> m b) -> m b

    pure    :: a -> m a
#+END_SRC

#+attr_reveal: :frag (roll-in)
#+BEGIN_SRC haskell
instance Monad Maybe where
    (Just x) >>= k      = k x
    Nothing  >>= _      = Nothing

    pure x = Just x
#+END_SRC


\begin{multline}
\shoveleft F : C \to D \\
\shoveleft X \in C \text{ assign an object } F(X) \in D \\
\shoveleft f : X \rightarrow Y \in C
\text{ assign an arrow } F(f) : F(X) \rightarrow F(Y) \in D
\end{multline}


#+attr_reveal: :frag (roll-in)
\begin{multline}
\shoveleft f : X \rightarrow Y \in C, g : Y \rightarrow Z \in C \\
F(g \circ f) = F(g) \circ F(f) \\ \\
\shoveleft F(\text{id}_x)=\text{id}_{F(x)}
\end{multline}
