intro-fp3.html
<section id="slide-orgaec73bf">
<h4 id="orgaec73bf">Promise</h4>
<aside class="notes">
<p>
Давайте посмотрим на функции ниже и подумаем как нам сделать следующее: получить
клиента по имени, потом по его адресу найти менеджера и запланировать между ними
встречу. И сделать все это асинхронно, без блокировок.
</p>

</aside>
<div class="org-src-container">

<pre  class="src src-java"><code trim><code><span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">Promise</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">Customer</span><span style="color: #51afef;">&gt;</span> <span style="color: #c678dd;">getCustomerByName</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">name</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span> ... <span style="color: #51afef;">}</span></code>
<code><span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">Promise</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">Manager</span><span style="color: #51afef;">&gt;</span> <span style="color: #c678dd;">getLocalManager</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">Address</span> <span style="color: #dcaeea;">customerAddress</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span> ... <span style="color: #51afef;">}</span></code>
<code><span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">Promise</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">Meeting</span><span style="color: #51afef;">&gt;</span> <span style="color: #c678dd;">scheduleMeeting</span><span style="color: #51afef;">(</span><span style="color: #ECBE7B;">Manager</span> <span style="color: #dcaeea;">manager</span>, <span style="color: #ECBE7B;">Customer</span> <span style="color: #dcaeea;">customer</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span> ... <span style="color: #51afef;">}</span></code>
</code></pre>
</div>

<aside class="notes">
<p>
На самом деле для этого нам не нужно ничего знать кроме того что Promise также
является монадой. Сделать то что мы хотим можно следующим образом:
</p>

</aside>
<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #ECBE7B;">Promise</span><span style="color: #51afef;">&lt;</span><span style="color: #ECBE7B;">Meeting</span><span style="color: #51afef;">&gt;</span> <span style="color: #dcaeea;">meeting</span> = getCustomerByName<span style="color: #51afef;">(</span>name<span style="color: #51afef;">)</span></code>
<code>    .flatMap<span style="color: #51afef;">(</span>customer -&gt;</code>
<code>             getLocalManager<span style="color: #c678dd;">(</span>customer.getAddress<span style="color: #98be65;">()</span><span style="color: #c678dd;">)</span></code>
<code>                 .flatMap<span style="color: #c678dd;">(</span>manager -&gt;</code>
<code>                          scheduleMeeting<span style="color: #98be65;">(</span>manager, customer<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>;</code>
</code></pre>
</div>

<aside class="notes">
<p>
Таким образом мы можем строить цепочки связанных асинхронных вызовов не
используя коллбеки или какие-то дополнительные инструменты синхронизации.
</p>

</aside>
</section>
<section id="slide-org3b6fc9d">
<h4 id="org3b6fc9d">For comprehension</h4>
<aside class="notes">
<p>
В Haskell и Scala монады настолько распространены, что существует специальный
синтаксис для композиции монадических функций. Благодаря ему можно переписать
этот код:
</p>

</aside>
</section>
<section id="slide-org3b6fc9d-split">
<div class="org-src-container">

<pre  class="src src-scala"><code trim><code><span style="color: #51afef;">val</span> <span style="color: #dcaeea;">meeting</span> <span style="color: #51afef;">=</span> getCustomerByName(name)</code>
<code>  .flatMap(customer <span style="color: #51afef;">=&gt;</span></code>
<code>      getLocalManager(customer.address)</code>
<code>        .flatMap(manager <span style="color: #51afef;">=&gt;</span></code>
<code>          scheduleMeeting(manager, customer))</code>
<code>  )</code>
</code></pre>
</div>

<aside class="notes">
<p>
Вот так:
</p>

</aside>
<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #51afef;">val</span> <span style="color: #dcaeea;">meeting</span> <span style="color: #51afef;">=</span> <span style="color: #51afef;">for</span> {</code>
<code>  customer <span style="color: #51afef;">&lt;-</span> getCustomerByName(name)</code>
<code>  manager <span style="color: #51afef;">&lt;-</span> getLocalManager(customer.address)</code>
<code>  meeting <span style="color: #51afef;">&lt;-</span> scheduleMeeting(manager, customer)</code>
<code>} <span style="color: #51afef;">yield</span> meeting</code>
</code></pre>
</div>

<aside class="notes">
<p>
В Scala такая форма записи называется for-comprehension
</p>

</aside>
</section>
<section id="slide-org3b6fc9d-split">

<aside class="notes">
<p>
Either?
</p>

</aside>

</section>
</section>
<section>
<section id="slide-orgaf01276">
<h2 id="orgaf01276">End</h2>
<aside class="notes">
<p>
Абстракции крайне важны. В принципе все чем мы занимаемся в программировании -
это проектирование абстракций и взаимодействий между ними. К признакам хороших
абстракций можно отнести возможность комбинировать их друг с другом и
универсальность, то есть количество разных вещей, которые можно выразить через
абстракцию.
</p>

<p>
У математиков очень большой опыт в построении и использовании абстракций. И
поскольку язык Хаскелл был разработан математиками, то нет ничего удивительного
что в нем используются знакомые математикам и проверенные временем абстракции. И
дальше они уже потихоньку протекают в мейнстрим языки программирования.
</p>






<p>
Это позволяет рассуждать о коде,  в чем и должны помогать паттерны. Только в отличие от ооп и 3ех разновидностей стнглтонов под этими паттернами есть матиматическое основание. И строгие поавила что является моноидом, а что нет. При этом эти правила хоть и не требуются еа уровне языка, зотя бы можно проверитб юнит тестом.
</p>

<p>
Слыша слово моноид я понимаю что это что-то что я могу заредюсить и при этом сделать это параллельно
Свойство ассоциативности кажется таким не существенным, но оно очень мощное.
</p>

<p>
Семигруппа - значит можем параллелить или асинхронно обробатовать батчами
Моноид - можем делать фолд A functor is a way to apply a function over or around
some structure that we don’t want to alter. That is, we want to apply the
function to the value that is “inside” some structure and leave the structure
alone.
</p>

<p>
То же самое с декомпозицией большой задачи. Мой опыт показывает, что чем меньше
контекста нужно держать в голове для осознания одной строчки кода, тем проще её
понять. В Haskell все направлено на то, чтобы этот контекст сделать как можно
меньше, то есть, чтобы не думать. Чистые функции — чтобы не думать о посторонних
эффектах. Иммутабельность — чтобы не думать, где переменная могла измениться.
Типы — чтобы не думать, какую экзотику могут скормить в нашу функцию.
Полиморфизм — чтобы вообще не думать о конкретных значениях, а думать о
действиях. Разделение контекста и значений на уровне типов — чтобы не думать,
какую часть внешнего мира изменит вызов этой функции. Алгебраические типы данных
— чтобы не думать обо всех случаях и сценариях сразу. Ряд можно продолжать долго
</p>

</aside>

</section>
</section>
<section>
<section id="slide-org5024c61">
<h2 id="org5024c61">Trash</h2>
</section>
<section id="slide-org5024c61-split">
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><code><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Functor</span> m <span style="color: #dcaeea;">=&gt;</span> <span style="color: #ECBE7B;">Monad</span> m <span style="color: #51afef;">where</span></code>
<code>    (<span style="color: #dcaeea;">&gt;&gt;=</span>)   <span style="color: #dcaeea;">::</span> m a <span style="color: #dcaeea;">-&gt;</span> (a <span style="color: #dcaeea;">-&gt;</span> m b) <span style="color: #dcaeea;">-&gt;</span> m b</code>
<code></code>
<code>    pure    <span style="color: #dcaeea;">::</span> a <span style="color: #dcaeea;">-&gt;</span> m a</code>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment (roll-in)"><code trim><code><span style="color: #51afef;">instance</span> <span style="color: #ECBE7B;">Monad</span> <span style="color: #ECBE7B;">Maybe</span> <span style="color: #51afef;">where</span></code>
<code>    (<span style="color: #ECBE7B;">Just</span> x) <span style="color: #dcaeea;">&gt;&gt;=</span> k      <span style="color: #dcaeea;">=</span> k x</code>
<code>    <span style="color: #ECBE7B;">Nothing</span>  <span style="color: #dcaeea;">&gt;&gt;=</span> <span style="color: #51afef;">_</span>      <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Nothing</span></code>
<code></code>
<code>    pure x <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Just</span> x</code>
</code></pre>
</div>


<div>
\begin{multline}
\shoveleft F : C \to D \\
\shoveleft X \in C \text{ assign an object } F(X) \in D \\
\shoveleft f : X \rightarrow Y \in C
\text{ assign an arrow } F(f) : F(X) \rightarrow F(Y) \in D
\end{multline}

</div>


<div class="fragment (roll-in)">
\begin{multline}
\shoveleft f : X \rightarrow Y \in C, g : Y \rightarrow Z \in C \\
F(g \circ f) = F(g) \circ F(f) \\ \\
\shoveleft F(\text{id}_x)=\text{id}_{F(x)}
\end{multline}

</div>
</section>
</section>
</div>
</div>
<script src="./reveal.js-3.8.0/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: './reveal.js-3.8.0/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
